window.CHANGELOG_DATA = [
	{
        date: "2026-04-30",
        title: "客户端/服务端正式版 V1.10 更新",
        content: [
			"未更新全量包",
            "通达铁路大版本更新",
            "删除carry on搬运（之前没删干净）",
            "删除Tom的简易储存，更改为超越维度",
            "客户端界面整改",
            "客户端性能占用优化（降低占用）",
            "删除会导致崩溃的结构",
            "删除掌中明月以及其前置，更换为钠的动态光源",
			"更新机械动力火炮为官方最新版本",
			"更新伪装方块重量逻辑",
			"更新速度与升力关系公式（现为平方关系）",
			"客户端启动及世界加载速度优化",
			"新增了一种市场载具"
        ]
    },
    {
        date: "2026-04-28",
        title: "正式版 V1.0.1.1 更新",
        content: [
			"未更新全量包",
            "修复创意传动红石遥控器bug",
            "删除 carry on (搬运)模组",
            "增加让升力等于速度平方的模组",
            "增加现代化UI",
            "修复 fly higher 服务器崩溃问题",
            "增加键位冲突显示",
            "修改了部分键位冲突"
        ]
    },


];
