window.CHANGELOG_DATA = [
    {
        date: "2026-05-03",
        title: "客户端正式版 V1.2.0 更新",
        content: [
            "未更新全量包",
            "暂未更新服务端",
            "上线正式版载具市场（欢迎各大作者前来投稿）",
            "修复物品统一问题",
            "调高了下届和末地结构概率（新档生效）",
            "修复部分材质冲突",
            "地形生成预设微调，不影响原来存档",
            "修复一些bug",
            "任务调整",
            "neoforge更新",
            "兼容老存档"
        ]
    },
    {
        date: "2026-04-30",
        title: "客户端/服务端正式版 V1.1.0 更新",
        content: [
            "未更新全量包",
            "通达铁路大版本更新",
            "删除 carry on 搬运（之前没删干净）",
            "删除 Tom 的简易储存，更改为超越维度",
            "客户端界面整改",
            "客户端性能占用优化（降低占用）",
            "删除会导致崩溃的结构",
            "删除掌中明月以及其前置，更换为钠的动态光源",
            "更新机械动力火炮为官方最新版本",
            "更新伪装方块重量逻辑",
            "更新速度与升力关系公式（现为平方关系）",
            "客户端启动及世界加载速度优化",
            "新增了一种市场载具"
        ]
    },
    {
        date: "2026-04-28",
        title: "正式版 V1.0.1.1 更新",
        content: [
            "未更新全量包",
            "修复创意传动红石遥控器 bug",
            "删除 carry on 搬运模组",
            "增加让升力等于速度平方的模组",
            "增加现代化 UI",
            "修复 fly higher 服务器崩溃问题",
            "增加键位冲突显示",
            "修改了部分键位冲突"
        ]
    }
];
